{
    "Zowe CLI quick start": {
        "Get started with Zowe CLI quickly and easily.": "This article presumes that your role is that of a systems administrator or you possess prerequisite knowledge of command-line tools and writing scripts. If you prefer more detailed instructions, see [Installing Zowe CLI](../user-guide/cli-installcli.md)."
    },
    "Installing": {
        "The following topics describe the Zowe CLI system requirements and the various methods to use to install Zowe CLI.": {
            "Software Requirements": "Before you install Zowe CLI, download and install Node.js and npm. Use an LTS version of Node.js that is compatible with your version of npm. For a list of compatible versions, see [Node.js Previous Releases](https://nodejs.org/en/download/releases/).",
            "(Linux only)": "On headless Linux, follow the procedure documented in the [SCS plug-in Readme](https://github.com/zowe/zowe-cli-scs-plugin/blob/master/README.md#software-requirements)."
        },
        "Installing Zowe CLI core from public npm": "Issue the following command to install the core CLI:\n\n```\nnpm install -g @zowe/cli@zowe-v2-lts\n```",
        "Installing CLI plug-ins": "```\nzowe plugins install @zowe/cics-for-zowe-cli@zowe-v2-lts @zowe/db2-for-zowe-cli@zowe-v2-lts @zowe/ims-for-zowe-cli@zowe-v2-lts @zowe/mq-for-zowe-cli@zowe-v2-lts @zowe/zos-ftp-for-zowe-cli@zowe-v2-lts\n```"
    },
    "Issuing your first commands": {
        "Issue `zowe --help` to display full command help. Append `--help` (alias `-h`) to any command to see available command actions and options.": {
            "Optionally": "You can view the Zowe CLI web help in a browser window. For more information, see [Displaying help](../user-guide/cli-using-displaying-help.md).",
            "All Zowe CLI commands start with `zowe` followed by the name of the [core command group](../user-guide/cli-using-understanding-core-command-groups.md).": "For example, `zowe plugins -h`. To interact with the mainframe, type `zowe` followed by a command group, action, and object. Use options to specify your connection details such as password and system name."
        },
        "Listing all data sets under a high-level qualifier (HLQ)": {
            "Example": "```\nzowe zos-files list data-set \"MY.DATASET.*\" --host my.company.com --port 123 --user myusername123 --pass mypassword123\n```"
        },
        "Downloading a partitioned data-set (PDS) member to a local file": {
            "Example": "```\nzowe zos-files download data-set \"MY.DATA.SET(member)\" -f \"mylocalfile.txt\" --host my.company.com --port 123 --user myusername123 --pass mypassword123\n```"
        }
    },
    "Team profiles": {
        "Zowe CLI V2-LTS now supports team profiles. The process of setting up team profiles is simple and can be rolled out easily across your organization. We highly recommend that you configure team profiles to support your Zowe CLI implementation.": "For more information, see [Using team profiles](../user-guide/cli-using-using-team-profiles.md)."
    },
    "Using profiles": {
        "Zowe profiles let you store configuration details such as username, password, host, and port for a mainframe system. Switch between profiles to quickly target different subsystems and avoid typing connection details on every command.": {
            "Profile types": "Most command groups require a `zosmf-profile`, but some plug-ins add their own profile types. For example, the CICS plug-in has a `cics-profile`. The profile type that a command requires is defined in the `PROFILE OPTIONS` section of the help response.",
            "Creating zosmf profiles": "```\nzowe profiles create zosmf-profile myprofile123 --host my.company.com --port 123 --user myusername123 --password mypassword123\n```",
            "Using zosmf profiles": "```\nzowe zos-files download data-set \"MY.DATA.SET(member)\" -f \"mylocalfile.txt\" --zosmf-profile myprofile123\n```"
        }
    },
    "Writing scripts": {
        "You can write Zowe CLI scripts to streamline your daily development processes or conduct mainframe actions from an off-platform automation tool such as Jenkins or TravisCI.": {
            "Example": "You want to delete a list of temporary datasets. Use Zowe CLI to download the list, loop through the list, and delete each dataset using the `zowe zos-files delete` command:\n```\n#!/bin/bash\nset -e\n# Obtain the list of temporary project datasets\ndslist=$(zowe zos-files list dataset \"my.project.ds*\")\n# Delete each dataset in the list\nIFS=$'\\n'for ds in $dslist\ndo\necho \"Deleting Temporary Project Dataset: $ds\"\nzowe files delete ds \"$ds\" -f\ndone\n```"
        }
    },
    "Next steps": {
        "You successfully installed Zowe CLI, issued your first commands, and wrote a simple script! Next, you might want to perform the following tasks:": {
            "Issue the `zowe --help` command to explore the product functionality, or review the online web help": "Learn how to configure Zowe CLI run Zowe CLI in daemon mode Daemon mode significantly improves the performance of Zowe CLI commands by running Zowe CLI as a persistent background process.",
            "Learn about configuring environment variables to store configuration options": "Learn about integrating with API Mediation Layer",
            "Learn about writing scripts and integrating them with an automation server, such as Jenkins": "See what plugins are available for the CLI",
            "Learn about developing for the CLI contributing to core and developing plugins": ""
        }
    }
}
